[{
  "title": "Prizma Paraíso - Lucio Engenharia",
  "slug": "prizma-paraiso",
  "description": "A landing page for a luxury real state located in Sao Paulo, Brazil. To communicate with the entire campaign that was done for it, the website leant heavily on diagonal shapes and discrete animations.\nThe mobile version should had all that communication too, which was a challenge to do and maintain the diagonal shapes on every size below the planned version.",
  "type": "landing page",
  "stack": ["html5", "css3", "javascript", "gulp", "php", "mysql"],
  "image": "/v1537659343/prizma.jpg"
},{
  "title": "Hospital Israelita Albert Einstein",
  "slug": "eintein-brainbee",
  "description": "The most important hospital in Brazil wanted a new version of the competition website \"Neuroscience Olympics.\" It needed to say all the necessary information in only one page and because of that became a very large content website.\nTo avoid scaring the final user, the website has a lazyload property and lots of contextual animation, made with css, to ease the navigation around each topic. The final goal was to inform the participants about the event overall.",
  "type": "website",
  "stack": ["html5", "css3", "javascript", "gulp"],
  "image": ",x_320,y_4855/v1537659343/brainbee.jpg"
},{
  "title": "Hospital Israelita Albert Einstein",
  "slug": "eintein-ensino-tecnico",
  "description": "The most important hospital in Brazil was launching they brand new certificate courses. This landing page were created to accommodate the traffic. The main goal is to guide the visitor to the subscription buttons located on the second fold.\nAs the target market it's between 15 - 25 years, the website was developed for mobile first and with lots of different shapes trying to transmit a more youthful image on the desktop",
  "type": "Landing Page",
  "stack": ["html5", "css3", "javascript", "gulp"],
  "image": "/v1537659343/ensino-tecnico.jpg"
},{
  "title": "Greens - Just Good Food",
  "slug": "greensie",
  "description": "A new Healthy food restaurant in Ireland needed a clear solution to presented their menu which still had to be easy to maintain and perform tasks like add new options and types of food, besides highlighting up-to-date pictures.\nAlong with the development of the Wordpress theme, the challenge was to create a customized plugin able to provide the small staff with visual and structured way to input the necessary data without compromising the website's visual hierarchy.",
  "type": "website",
  "stack": ["wordpress", "html5", "css3", "javascript", "mysql", "apache", "grunt"],
  "url": "http://greens.ie",
  "image": "/v1525121948/portfolio-full/greens.jpg"
},{
  "title": "Rimaq - Máquinas de Estampar",
  "slug": "rimaq-site",
  "description": "Rimaq is one of the leaders on the machine manufacturing industry in Brazil. With over 200k views per month, its website needed a fresh look to present the business and corporate sides of the brand in a balanced way.\nThe challenge was: how to work with disadvantages such as a legacy database and a outdated Wordpress and be able to create a new website’s version that is focused on performance mobility (while managing Rimaq’s expectations)?\nThe first step was an aggressive Wordpress maintenance, updating it to the latest version. After that, we removed old plugins and included in the source code a few functions that some of the plugins used to do before, thus enhancing the overall performance and scalability.\nWhile the new theme was being developed, the work around the existent content was also very intricate because the layout required new ways to show the same information and all the content should be updated to the new identity without any editing by the client's staff.\nIn addition, the main focus on the mobile design was an effective UX alongside with performance. An in-depth navigation study, with A/B tests, and server analysis was done to direct the flow to the most relevant sections of the customer's audience.",
  "type": "website",
  "stack": ["wordpress", "html5", "css3", "javascript", "mysql", "apache", "grunt", "nginx"],
  "url": "http://rimaq.com.br",
  "image": "/v1525121946/portfolio-full/rimaq.jpg"
},{
  "title": "Vunesp",
  "slug": "vunesp",
  "description": "The Fundação Vunesp is one of Brazil’s most respected educational institutions. With over 1.5 million views/month, the academy’s website —  with the previous version dated from the early 2000s — was the main point of contact with their students. So, the need to improve its UX and the overall performance was imminent.\nOur main focus was on the adoption of reusable components and tooling to improve code quality and support a really extensive range of browsers, while using the research done previously to back up the design decisions. The first iteration of the new website generate positive reviews online and a lot of good feedback in a very short amount of time.",
  "type": "website",
  "stack": ["html5", "css3", "javascript", "bootstrap", "gulp"],
  "url": "https://www.vunesp.com.br/",
  "image": "/v1525121950/portfolio-full/vunesp.jpg"
},{
  "title": "Quintal do Espeto",
  "slug": "quintal-do-espeto",
  "description": "A restaurant chain in São Paulo needed a better way to advertise the events and promotions on all their locations. The new website should be aligned with their new marketing strategy while being very effective on mobile, which they had lack with the previous version.\nIt was a very challenging design to implement because of the several extra elements required by it. A couple of updates had followed the initial deploy, updating the support and optimizing the overall performance.\nThe final Wordpress Theme has 2 custom plugins mainly to optimize the client's flow, providing the customer's staff the capabilities required to let them manage by themselves the core parts of the website and change the featured images in order to update it according to the latest promotions run in its restaurants.",
  "type": "website",
  "stack": ["wordpress", "html5", "css3", "mysql", "apache"],
  "url": "http://qiuntaldoespeto.com.br",
  "image": "/v1525121956/portfolio-full/quintal.jpg"
},{
  "title": "Calculadora IOF",
  "slug": "calculadora-iof",
  "description": "A web app that uses web scraping with Phantomjs to create an API with the update quote currency of all currencies traded on the Brazilian Stock Exchange (BOVESPA).\nEvery day the bot updates the quote currencies from trusted sources and then offers a way to calculate the taxes that can affect the final value informed by the user. It was made in pure javascript for study, but with a Vuejs version in the works.",
  "type": "application (SPA, PWA)",
  "stack": ["vuejs", "javascript", "mysql", "nginx", "gulp"],
  "url": "https://calculadoraiof.com.br",
  "image": "/v1525121947/portfolio-full/iof.jpg"
},{
  "title": "Silveira Veículos",
  "slug": "silveira-veiculos",
  "description": "A small car dealership that needed a better, seamless way to add vehicles to its portfolio. This was the briefing. With a small team non tech-savvy, I created a custom plugin that fits the layout requirements.",
  "type": "website",
  "stack": ["wordpress", "html5", "css3", "mysql", "apache"],
  "url": "http://silveiraveiculos.com.br",
  "image": "/v1525121945/portfolio-full/silveira-veiculos.jpg"
}]
